---
kind: method
id: M:Autodesk.Revit.DB.SolidOrShellTessellationControls.#ctor
source: html/d6e9121b-b932-0403-7551-b01c8c5bad5d.htm
---
# Autodesk.Revit.DB.SolidOrShellTessellationControls.#ctor Method

Default constructor.

## Syntax (C#)
```csharp
public SolidOrShellTessellationControls()
```